Политика конфиденциальности расширения "Расписание СамГТУ"

Настоящая политика конфиденциальности описывает, как расширение "Расписание СамГТУ" (далее – "Расширение") обрабатывает данные пользователей.

Сбор данных

Расширение "Расписание СамГТУ" **не собирает** никакой личной информации о пользователях.  Расширение только извлекает и отображает информацию о расписании занятий из личного кабинета студента на сайте lk.samgtu.ru.  Эта информация извлекается локально в браузере пользователя и не передается разработчику Расширения.

Хранение данных

Расширение сохраняет данные о расписании в локальном хранилище браузера (Chrome Storage API) для обеспечения быстрого доступа и возможности просмотра расписания без подключения к интернету.  Эти данные хранятся только на устройстве пользователя и не передаются третьим лицам.

Передача данных

Расширение **не передает** никакие пользовательские данные третьим лицам.

Изменения в политике конфиденциальности

Настоящая политика конфиденциальности может быть изменена в будущем.  Актуальная версия политики конфиденциальности всегда будет доступна по данному URL.

Дата вступления в силу: 31-05-2025
